nxp-mcuxpresso/mcux-sdk/devices/LPC5534/drivers/fsl_power.c
    /* Release Wake up I/O reset (WAKEUPIO_RSTN = 1)*/
    PMC->WAKEUPIOCTRL |= PMC_WAKEUPIOCTRL_WAKEUPIO_RSTN_MASK;
}

void POWER_GetWakeUpCause(power_reset_cause_t *reset_cause,
                          power_boot_mode_t *boot_mode,
                          power_wakeup_pin_t *wakeup_pin_cause)
{
    uint32_t reset_cause_reg;
    uint32_t boot_mode_reg;
    uint32_t wakeupio_cause_reg;

    boot_mode_reg = (PMC->STATUS & PMC_STATUS_BOOTMODE_MASK) >> PMC_STATUS_BOOTMODE_SHIFT;

    switch (boot_mode_reg)
    {
        case 1:
            /* DEEP-SLEEP */
            *boot_mode = kBOOT_MODE_LP_DEEP_SLEEP;
            break;
        case 2:
            /* POWER-DOWN */
            *boot_mode = kBOOT_MODE_LP_POWER_DOWN;
            break;
        case 3:
            /* DEEP-POWER-DOWN */
            *boot_mode = kBOOT_MODE_LP_DEEP_POWER_DOWN;
            break;
        default:
            /* All non Low Power Mode wake-up */
            *boot_mode = kBOOT_MODE_POWER_UP;
            break;
    }

    wakeupio_cause_reg = PMC->WAKEIOCAUSE;

    if (boot_mode_reg == 0UL)
    {
        /* POWER-UP: Power On Reset, Pin reset, Brown Out Detectors, Software Reset:
         * PMC has been reset, so wake up pin event not expected to have happened. */
        *wakeup_pin_cause = kWAKEUP_PIN_NONE;
    }
    else
    {
        switch (((wakeupio_cause_reg & PMC_WAKEIOCAUSE_WAKEUPIO_EVENTS_ORDER_MASK) >>
                 PMC_WAKEIOCAUSE_WAKEUPIO_EVENTS_ORDER_SHIFT))
        {
            case 0x0:
                *wakeup_pin_cause = kWAKEUP_PIN_NONE;
                break;
            case 0x1:
                *wakeup_pin_cause = kWAKEUP_PIN_0;
                break;
            case 0x2:
                *wakeup_pin_cause = kWAKEUP_PIN_1;
                break;
            case 0x4:
                *wakeup_pin_cause = kWAKEUP_PIN_2;
                break;
            case 0x8:
                *wakeup_pin_cause = kWAKEUP_PIN_3;
                break;
            case 0x10:
                *wakeup_pin_cause = kWAKEUP_PIN_4;
                break;
            default:
                /* Mutiple */
                *wakeup_pin_cause = kWAKEUP_PIN_MULTIPLE;
                break;
        }
    }

    reset_cause_reg = PMC->AOREG1;

    /*
     * Prioritize interrupts source with respect to how critical they are.
     */
    if (0U != (reset_cause_reg & PMC_AOREG1_CDOGRESET_MASK))
    { /* Code Watchdog Reset */
        *reset_cause = kRESET_CAUSE_CDOGRESET;
    }
    else
    {
        if (0UL != (reset_cause_reg & PMC_AOREG1_WDTRESET_MASK))
        { /* Watchdog Timer Reset */
            *reset_cause = kRESET_CAUSE_WDTRESET;
        }
        else
        {
            if (0U != (reset_cause_reg & PMC_AOREG1_SYSTEMRESET_MASK))
            { /* ARM System Reset */
                *reset_cause = kRESET_CAUSE_ARMSYSTEMRESET;
            }
            else
            {
                if (boot_mode_reg != 3UL) /* POWER-UP: Power On Reset, Pin reset, Brown Out Detectors, Software Reset,
                                           DEEP-SLEEP and POWER-DOWN */
                {
                    /*
                     * Prioritise Reset causes, starting from the strongest (Power On Reset)
                     */
                    if (0U != (reset_cause_reg & PMC_AOREG1_POR_MASK))
                    { /* Power On Reset */
                        *reset_cause = kRESET_CAUSE_POR;
                    }
                    else
                    {
                        if (0U != (reset_cause_reg & PMC_AOREG1_BODRESET_MASK))
                        { /* Brown-out Detector reset (either BODVBAT or BODCORE) */
                            *reset_cause = kRESET_CAUSE_BODRESET;
                        }
                        else
                        {
                            if (0U != (reset_cause_reg & PMC_AOREG1_PADRESET_MASK))
                            { /* Hardware Pin Reset */
                                *reset_cause = kRESET_CAUSE_PADRESET;
                            }
                            else
                            {
                                if (0U != (reset_cause_reg & PMC_AOREG1_SWRRESET_MASK))
                                { /* Software triggered Reset */
                                    *reset_cause = kRESET_CAUSE_SWRRESET;
                                }
                                else
                                { /* Unknown Reset Cause (shall never occur) */
                                    *reset_cause = kRESET_CAUSE_NOT_DETERMINISTIC;
                                }
                            }
                        }
                    }
                }
                else /* boot_mode_reg == 3 : DEEP-POWER-DOWN */
                {
                    switch (((reset_cause_reg & PMC_AOREG1_DPD_EVENTS_ORDER_MASK) >> PMC_AOREG1_DPD_EVENTS_ORDER_SHIFT))
                    {
                        case 1:
                            *reset_cause = kRESET_CAUSE_DPDRESET_WAKEUPIO;
                            break;
                        case 2:
                            *reset_cause = kRESET_CAUSE_DPDRESET_RTC;
                            break;
                        case 3:
                            *reset_cause = kRESET_CAUSE_DPDRESET_WAKEUPIO_RTC;
                            break;
                        case 4:
                            *reset_cause = kRESET_CAUSE_DPDRESET_OSTIMER;
                            break;
                        case 5:
                            *reset_cause = kRESET_CAUSE_DPDRESET_WAKEUPIO_OSTIMER;
                            break;
                        case 6:
                            *reset_cause = kRESET_CAUSE_DPDRESET_RTC_OSTIMER;
                            break;
                        case 7:
                            *reset_cause = kRESET_CAUSE_DPDRESET_WAKEUPIO_RTC_OSTIMER;
                            break;
                        default:
                            /* Unknown Reset Cause (shall not occur) */
                            *reset_cause = kRESET_CAUSE_NOT_DETERMINISTIC;
                            break;
                    }
                } // if ( boot_mode != 3 )

            } // if ( reset_cause_reg & PMC_AOREG1_CDOGRESET_MASK )

        } // if ( reset_cause_reg & PMC_AOREG1_WDTRESET_MASK )

