nxp-mcuxpresso/mcux-sdk/devices/LPC5534/drivers/fsl_power.c
            /* Only FRO32K, XTAL32K, FRO1M, COMP, BIAS, LDO_MEM and can VREF stay powered during POWERDOWN */
            PMC->PDSLEEPCFG0 =
                p_lowpower_cfg->PDCTRL[0] |
                (0xFFFFFFFFUL & (~((uint32_t)kPDRUNCFG_PD_FRO1M | (uint32_t)kPDRUNCFG_PD_FRO32K | (uint32_t)kPDRUNCFG_PD_XTAL32K | (uint32_t)kPDRUNCFG_PD_COMP |
                                 (uint32_t)kPDRUNCFG_PD_BIAS | (uint32_t)kPDRUNCFG_PD_LDOMEM | (uint32_t)kPDRUNCFG_PD_VREF)));
            PMC->PDSLEEPCFG1 = p_lowpower_cfg->PDCTRL[1];

            /* Make sure DEEP POWER DOWN reset is disabled */
            PMC->RESETCTRL = PMC->RESETCTRL & (~PMC_RESETCTRL_DPDWAKEUPRESETENABLE_MASK);

/* Enable VREF Module (reset & clock) */
#if (defined(LPC55S36_SERIES) || defined(LPC5536_SERIES) || defined(LPC5534_SERIES))
            vref_rst_state           = (SYSCON->PRESETCTRL3) & SYSCON_PRESETCTRL3_VREF_RST_MASK;
            vref_clk_state           = (SYSCON->AHBCLKCTRL3) & SYSCON_AHBCLKCTRL3_VREF_MASK;
            SYSCON->PRESETCTRLCLR[3] = SYSCON_PRESETCTRL3_VREF_RST_MASK;
            SYSCON->AHBCLKCTRLSET[3] = SYSCON_AHBCLKCTRL3_VREF_MASK;
#else
            vref_rst_state = (*(uint32_t *)(((uint32_t *)SYSCON->RESERVED_5))) & 0x40000UL;
            vref_clk_state = (*(uint32_t *)(((uint32_t *)SYSCON->RESERVED_9))) & 0x40000UL;
            *(uint32_t *)(((uint32_t *)SYSCON->RESERVED_7)) = 0x40000UL;
            *(uint32_t *)(((uint32_t *)SYSCON->RESERVED_10)) = 0x40000UL;
#endif

            /* Save VREF Module User Configuration ... */
            vref_regs[0] = VREF->CSR;
            vref_regs[1] = VREF->UTRIM;
            /* Save VREF Module Factory Trimmings ... */
            VREF->TEST_UNLOCK = 0x5AA5UL << 1; /* TEST_UNLOCK. Required before writting TRIM0 & TRIM1 */
            vref_regs[2]      = VREF->TRIM0;
            vref_regs[3]      = VREF->TRIM1;

            /* ... then enable VREF Module isolation */
            PMC->MISCCTRL = PMC->MISCCTRL | PMC_MISCCTRL_VREF_ISO_MASK;

            // CSSV2
            {
                syscon_css_clk_ctrl = SYSCON_CSS_CLK_CTRL_REG & (1U << 1);
#if (defined(LPC55S36_SERIES) || defined(LPC5536_SERIES) || defined(LPC5534_SERIES))
                syscon_css_clk_pclk_hclk = SYSCON->AHBCLKCTRL2 & ((uint32_t)1U << 18);
#else
                syscon_css_clk_pclk_hclk = SYSCON->AHBCLKCTRL[2] & ((uint32_t)1U << 18);
#endif

                /* Switch off DTRNG clocks */
                SYSCON_CSS_CLK_CTRL_CLR_REG = (1U << 1);

                /* Swicth off i_css_clk/pclk/hclk */
                SYSCON->AHBCLKCTRLCLR[2] = ((uint32_t)1U << 18);
            }

            /* CPU0 Retention */
            SYSCON->FUNCRETENTIONCTRL =
                (SYSCON->FUNCRETENTIONCTRL & SYSCON_FUNCRETENTIONCTRL_RET_LENTH_MASK) | p_lowpower_cfg->CPURETCTRL;

            /* Disable all IRQs */
            __disable_irq();

            /*
             * From here :
             *  1 - If an interrupt that is enable occurs, the _WFI instruction will not be executed and we won't enter
             * in POWER DOWN. 2 - If an interrupt that is not enable occurs, there is no consequence neither on the
             * execution of the low power mode nor on the behaviour of the CPU.
             */

            /* Switch PMC clock to 1 MHz and select LDO CORE (configured in High Power mode) as Core Logic supply source
             * when waking up from POWER-DOWN */
            PMC->CTRL = (PMC->CTRL & (~PMC_CTRL_SELCLOCK_MASK)) | PMC_CTRL_SELCORESUPPLYWK_MASK;

            /* Save user Core Supply Source configuration */
            core_supply_source = POWER_GetCorePowerSource();

            /* Store Analog Controller Registers */
            analog_ctrl_regs[0] = ANACTRL->FRO192M_CTRL;
            analog_ctrl_regs[1] = ANACTRL->ANALOG_CTRL_CFG;
            analog_ctrl_regs[2] = ANACTRL->ADC_CTRL;
            analog_ctrl_regs[3] = ANACTRL->XO32M_CTRL;
            analog_ctrl_regs[4] = ANACTRL->BOD_DCDC_INT_CTRL;
            analog_ctrl_regs[5] = ANACTRL->LDO_XO32M;
            analog_ctrl_regs[6] = ANACTRL->OSC_TESTBUS;

            /* Save Flash Cache settings, then disable and clear it */
            lpcac_ctrl_reg     = SYSCON->LPCAC_CTRL;
            SYSCON->LPCAC_CTRL = 0x3; /* dis_lpcac = '1', clr_lpcac = '1' */

/* Save ROM clock setting, then enable it.
 * It is important to have the ROM clock running before entering
 * POWER-DOWN for the following two reasons:
 * 1 - In case of POWER-DOWN with CPU state retention (which is the only
 *     option currently offered to the user), some flip-flops that depend
       on this clock need to be saved.
 * 2 - In case of POWER-DOWN without CPU state retention (which is a
 *     hardware feature that is NOT offered to the user for the time being)
 *     CPU reboot cannot occur if ROM clock has been shut down.
 */
#if (defined(LPC55S36_SERIES) || defined(LPC5536_SERIES) || defined(LPC5534_SERIES))
            syscon_ahbclk_reg_0      = SYSCON->AHBCLKCTRL0;
            SYSCON->AHBCLKCTRLSET[0] = SYSCON_AHBCLKCTRL0_ROM_MASK; /* Enable the clock for ROM */
#else
            syscon_ahbclk_reg_0 = SYSCON->AHBCLKCTRL[0];
            SYSCON->AHBCLKCTRLSET[0] = SYSCON_AHBCLKCTRL_ROM_MASK; /* Enable the clock for ROM */
#endif

            /* _WFI() */
            POWER_PowerCycleCpu();

/* Restore ROM clock setting */
#if (defined(LPC55S36_SERIES) || defined(LPC5536_SERIES) || defined(LPC5534_SERIES))
            SYSCON->AHBCLKCTRL0 = syscon_ahbclk_reg_0;
#else
            SYSCON->AHBCLKCTRL[0] = syscon_ahbclk_reg_0;
#endif
            /* Restore Flash Cache settings */
            SYSCON->LPCAC_CTRL = lpcac_ctrl_reg;

            /* Switch PMC clock to 12 MHz and Configure the PMC in ACTIVE mode */
            PMC->CTRL = (PMC->CTRL & (~PMC_CTRL_LPMODE_MASK)) | PMC_CTRL_SELCLOCK_MASK |
                        PMC_CTRL_LPMODE(LOWPOWER_CFG_LPMODE_ACTIVE);

#if (defined(LPC55S36_SERIES) || defined(LPC5536_SERIES) || defined(LPC5534_SERIES))
            {
                /* Restore i_css_clk/pclk/hclk */
                SYSCON->AHBCLKCTRLSET[2] = syscon_css_clk_pclk_hclk;

                /* Restore DTRNG clocks */
                SYSCON_CSS_CLK_CTRL_SET_REG = syscon_css_clk_ctrl;
            }
#endif

            /* Restore Analog Controller Registers */
            ANACTRL->FRO192M_CTRL      = analog_ctrl_regs[0] | ANACTRL_FRO192M_CTRL_WRTRIM_MASK;
            ANACTRL->ANALOG_CTRL_CFG   = analog_ctrl_regs[1];
            ANACTRL->ADC_CTRL          = analog_ctrl_regs[2];
            ANACTRL->XO32M_CTRL        = analog_ctrl_regs[3];
            ANACTRL->BOD_DCDC_INT_CTRL = analog_ctrl_regs[4];
            ANACTRL->LDO_XO32M         = analog_ctrl_regs[5];
            ANACTRL->OSC_TESTBUS       = analog_ctrl_regs[6];

            /* Restore VREF Module Factory Trimmings ... */
            VREF->TEST_UNLOCK = 0x5AA5UL << 1; /* TEST_UNLOCK. Required before writting TRIM0 & TRIM1 */
            VREF->TRIM0       = vref_regs[2];
            VREF->TRIM1       = vref_regs[3];
            /* ... then restore VREF Module User Configuration */
            VREF->CSR   = vref_regs[0];
            VREF->UTRIM = vref_regs[1];

