nxp-mcuxpresso/mcux-sdk/devices/LPC5534/drivers/fsl_power.c
    return (wakeup_io_ctrl_reg);
}

static uint32_t POWER_SetLdoAoLdoMemVoltage(uint32_t p_lp_mode)
{
    uint32_t voltage      = 0;
    uint32_t ldo_ao_trim  = 0;
    uint32_t ldo_mem_trim = 0;
    uint32_t lv_v_ldo_pmu, lv_v_ldo_pmu_boost;
    uint32_t lv_v_ldo_mem, lv_v_ldo_mem_boost;

#if (defined(LPC55S36_SERIES) || defined(LPC5536_SERIES) || defined(LPC5534_SERIES))
    ldo_ao_trim  = FLASH_NMPA_LDO_AO;
    ldo_mem_trim = FLASH_NMPA_LDO_MEM;
#endif

    switch (p_lp_mode)
    {
        case LOWPOWER_CFG_LPMODE_DEEPSLEEP:
        {
            if ((ldo_ao_trim & 0x80000000UL) != 0UL)
            {
                /* Apply settings coming from Flash */
                lv_v_ldo_pmu       = (ldo_ao_trim >> 8) & 0x1FUL;
                lv_v_ldo_pmu_boost = (ldo_ao_trim >> 13) & 0x1FUL;
            }
            else
            {
                /* Apply default settings */
                lv_v_ldo_pmu       = (uint32_t)V_AO_0P900;
                lv_v_ldo_pmu_boost = (uint32_t)V_AO_0P850;
            }
        }
        break;

        case LOWPOWER_CFG_LPMODE_POWERDOWN:
        {
            if ((ldo_ao_trim & 0x80000000UL) != 0U)
            {
                /* Apply settings coming from Flash */
                lv_v_ldo_pmu       = (ldo_ao_trim >> 18) & 0x1FUL;
                lv_v_ldo_pmu_boost = (ldo_ao_trim >> 23) & 0x1FUL;
            }
            else
            {
                /* Apply default settings */
                lv_v_ldo_pmu       = (uint32_t)V_AO_0P800;
                lv_v_ldo_pmu_boost = (uint32_t)V_AO_0P750;
            }
        }
        break;

        case LOWPOWER_CFG_LPMODE_DEEPPOWERDOWN:
        {
            if ((ldo_ao_trim & 0x80000000UL) != 0UL)
            {
                /* Apply settings coming from Flash */
                lv_v_ldo_pmu       = (ldo_ao_trim >> 18) & 0x1FUL;
                lv_v_ldo_pmu_boost = (ldo_ao_trim >> 23) & 0x1FUL;
            }
            else
            {
                /* Apply default settings */
                lv_v_ldo_pmu       = (uint32_t)V_AO_0P800;
                lv_v_ldo_pmu_boost = (uint32_t)V_AO_0P750;
            }
        }
        break;

        default:
            /* We should never reach this point */
            lv_v_ldo_pmu       = (uint32_t)V_AO_1P100;
            lv_v_ldo_pmu_boost = (uint32_t)V_AO_1P050;
            break;
    }

    if ((ldo_mem_trim & 0x80000000U) != 0UL)
    {
        /* Apply settings coming from Flash */
        lv_v_ldo_mem       = ldo_mem_trim & 0x1FUL;
        lv_v_ldo_mem_boost = (ldo_mem_trim >> 8) & 0x1FUL;
    }
    else
    {
        /* Apply default settings */
        lv_v_ldo_mem       = (uint32_t)V_AO_0P750; /* Set to 0.75V (voltage Scaling) */
        lv_v_ldo_mem_boost = (uint32_t)V_AO_0P700; /* Set to 0.7V  (voltage Scaling) */
    }

    /* The Memories Voltage settings below are for voltage scaling */
    voltage = (lv_v_ldo_pmu << LOWPOWER_VOLTAGE_LDO_PMU_INDEX) |
              (lv_v_ldo_pmu_boost << LOWPOWER_VOLTAGE_LDO_PMU_BOOST_INDEX) |
              (lv_v_ldo_mem << LOWPOWER_VOLTAGE_LDO_MEM_INDEX) |
              (lv_v_ldo_mem_boost << LOWPOWER_VOLTAGE_LDO_MEM_BOOST_INDEX);

    return (voltage);
}

/**
 * @brief	Configures System Power Profile
 * @param	power_profile : Low/Medium/High
 * @return	Nothing
 */
static void POWER_SetSystemPowerProfile(v_system_power_profile_t power_profile)
{
    uint32_t dcdcTrimValue0 = 0;
    uint32_t dcdcTrimValue1 = 0;

    switch (power_profile)
    {
        case V_SYSTEM_POWER_PROFILE_MEDIUM:
            /* Medium */

#if (defined(LPC55S36_SERIES) || defined(LPC5536_SERIES) || defined(LPC5534_SERIES))
            dcdcTrimValue0 = FLASH_NMPA_DCDC_POWER_PROFILE_MEDIUM_ARRAY0;
            dcdcTrimValue1 = FLASH_NMPA_DCDC_POWER_PROFILE_MEDIUM_ARRAY1;
#endif

            if (0UL != (dcdcTrimValue0 & 0x1UL))
            {
                /* DCDC Trimmings in Flash are valid */
                dcdcTrimValue0 = (uint32_t)dcdcTrimValue0 >> 1;
                PMC->DCDC0     = dcdcTrimValue0;
                PMC->DCDC1     = dcdcTrimValue1;
            }
            else
            {
                /* DCDC Trimmings in Flash are not valid.
                 * Set a default value */
                PMC->DCDC0 = 0x0220ACF1UL >> 1;
                PMC->DCDC1 = 0x01D05C78UL;
            }

            break;

        case V_SYSTEM_POWER_PROFILE_HIGH:
/* High */
#if (defined(LPC55S36_SERIES) || defined(LPC5536_SERIES) || defined(LPC5534_SERIES))
            dcdcTrimValue0 = FLASH_NMPA_DCDC_POWER_PROFILE_HIGH_ARRAY0;
            dcdcTrimValue1 = FLASH_NMPA_DCDC_POWER_PROFILE_HIGH_ARRAY1;
#endif

            if (0UL != (dcdcTrimValue0 & 0x1UL))
            {
                /* DCDC Trimmings in Flash are valid */
                dcdcTrimValue0 = dcdcTrimValue0 >> 1;
                PMC->DCDC0     = dcdcTrimValue0;
                PMC->DCDC1     = dcdcTrimValue1;
            }
            else
            {
                /* DCDC Trimmings in Flash are not valid.
                 * Set a default value */
                PMC->DCDC0 = 0x0228ACF9UL >> 1;
                PMC->DCDC1 = 0x01E05C68UL;
            }

            break;

        default:
/* Low */
#if (defined(LPC55S36_SERIES) || defined(LPC5536_SERIES) || defined(LPC5534_SERIES))
            dcdcTrimValue0 = FLASH_NMPA_DCDC_POWER_PROFILE_LOW_ARRAY0;
            dcdcTrimValue1 = FLASH_NMPA_DCDC_POWER_PROFILE_LOW_ARRAY1;
#endif

            if (0UL != (dcdcTrimValue0 & 0x1UL))
            {
                /* DCDC Trimmings in Flash are valid */
                dcdcTrimValue0 = dcdcTrimValue0 >> 1;
                PMC->DCDC0     = dcdcTrimValue0;
                PMC->DCDC1     = dcdcTrimValue1;
            }
            else
            {
                /* DCDC Trimmings in Flash are not valid.
                 * Set a default value */
                PMC->DCDC0 = 0x0210CCFDUL >> 1;
                PMC->DCDC1 = 0x01C05C98UL;
            }
            break;
    }
}

/**
 * @brief	Configures System Power Profile
 * @param	power_profile : Low/Medium/High
 * @return	Nothing
 */
static void POWER_SetVoltageForProcess(v_system_power_profile_t power_profile)
{
    /* Get Sample Process Corner */
    lowpower_process_corner_enum part_process_corner = POWER_GetPartProcessCorner();

    switch (part_process_corner)
    {
        case PROCESS_CORNER_SSS:
            /* Slow Corner */
            {
                switch (power_profile)
                {
                    case V_SYSTEM_POWER_PROFILE_MEDIUM:
                        /* Medium */
                        POWER_SetSystemVoltage(VOLTAGE_SSS_MED_MV);
                        break;

                    case V_SYSTEM_POWER_PROFILE_HIGH:
                        /* High */
                        POWER_SetSystemVoltage(VOLTAGE_SSS_HIG_MV);
                        break;

                    default:
                        /* V_SYSTEM_POWER_PROFILE_LOW */
                        POWER_SetSystemVoltage(VOLTAGE_SSS_LOW_MV);
                        break;
                } // switch(power_profile)
            }
            break;

        case PROCESS_CORNER_FFF:
            /* Fast Corner */
            {
                switch (power_profile)
                {
                    case V_SYSTEM_POWER_PROFILE_MEDIUM:
                        /* Medium */
                        POWER_SetSystemVoltage(VOLTAGE_FFF_MED_MV);
                        break;

                    case V_SYSTEM_POWER_PROFILE_HIGH:
                        /* High */
                        POWER_SetSystemVoltage(VOLTAGE_FFF_HIG_MV);
                        break;

                    default:
                        /* V_SYSTEM_POWER_PROFILE_LOW */
                        POWER_SetSystemVoltage(VOLTAGE_FFF_LOW_MV);
                        break;
                } // switch(power_profile)
            }
            break;

        default:
            /* Nominal (NNN) and all others Process Corners : assume Nominal Corner */
            {
                switch (power_profile)
                {
                    case V_SYSTEM_POWER_PROFILE_MEDIUM:
                        /* Medium */
                        POWER_SetSystemVoltage(VOLTAGE_NNN_MED_MV);
                        break;

                    case V_SYSTEM_POWER_PROFILE_HIGH:
                        /* High */
                        POWER_SetSystemVoltage(VOLTAGE_NNN_HIG_MV);
                        break;

                    default:
                        /* V_SYSTEM_POWER_PROFILE_LOW */
                        POWER_SetSystemVoltage(VOLTAGE_NNN_LOW_MV);
                        break;
                } // switch(power_profile)
            }
            break;
    } // switch(part_process_corner)
}

/**
 * @brief
 * @param
 * @return
 */
static lowpower_process_corner_enum POWER_GetPartProcessCorner(void)
{
    lowpower_process_corner_enum part_process_corner;
    uint32_t pvt_ringo_hz;
    uint32_t pvt_ringo_0 = 0;
    uint32_t pvt_ringo_1 = 0;

#if (defined(LPC55S36_SERIES) || defined(LPC5536_SERIES) || defined(LPC5534_SERIES))
    pvt_ringo_0 = FLASH_NMPA_PVT_MONITOR_0_RINGO;
    pvt_ringo_1 = FLASH_NMPA_PVT_MONITOR_1_RINGO;
#endif

